# Pandas

In [24]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

pd.Series([4,7,-5,3])

0    4
1    7
2   -5
3    3
dtype: int64

In [9]:
pd.Series([4,7,-5,3],index=['a','b','c','d'])

a    4
b    7
c   -5
d    3
dtype: int64

In [56]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3=pd.Series(sdata)
obj3.name='population'
obj3.index.name='state'
# obj3.values.name='nums'
obj3

state
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
Name: population, dtype: int64

In [16]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame=pd.DataFrame(data,columns=['year','state','pop'])
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [19]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four','five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [21]:
val=pd.Series([-1.2,-1.5,-1.9],index=['two','three','six'])
frame2.debt=val 
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6  -1.5
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   NaN
six    2003  Nevada  3.2  -1.9

In [23]:
frame2['eastern']=frame2.state=='Ohio'
frame2f

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6  -1.5     True
four   2001  Nevada  2.4   NaN    False
five   2002  Nevada  2.9   NaN    False
six    2003  Nevada  3.2  -1.9    False

In [25]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6  -1.5
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   NaN
six    2003  Nevada  3.2  -1.9

In [50]:
# 如果嵌套字典传给DataFrame，pandas就会被解释为：外层字典的键作为列，内层键则作为行索引
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3=pd.DataFrame(pop)
frame3
# frame3.T

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [54]:
# pd.DataFrame(pop,index=[2001,2002,2003])
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [70]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj.index=['1','2','3']
# obj.inde[1]='d'
obj

1    0
2    1
3    2
dtype: int64

In [72]:
pd.Series([1.5, -2.5, 0], index=pd.Index(np.arange(3)))

0    1.5
1   -2.5
2    0.0
dtype: float64

In [73]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(np.arange(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [81]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])
frame2=frame.reindex(['a','b','c','d'])
states = ['Texas', 'Utah', 'California']
frame2.reindex(columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [148]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah','New York'],columns=['one', 'two', 'three', 'four'])
print(data)
# data.loc[['Colorado','Utah'], ['four','one','two']]
# data.loc['Colorado':'Utah', ['four','one','two']]     #loc含头也含尾
# data.iloc[[1,2], [3, 0, 1]]     
# data.iloc[1:2, [3, 0, 1]]     
data.iloc[:,:4][data.three>5]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [208]:
df1=pd.DataFrame(np.arange(12.).reshape(3,4),columns=list('abcd'))
df2=pd.DataFrame(np.arange(20.).reshape((4,5)),columns=list('abcde'))
df2.loc[1,'b']=np.nan
df1+df2
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [206]:
print(df1)
# 1 / df1
df1.rdiv(1)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [209]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

-----DataFrame和Series之间的运算-----

In [213]:
frame=pd.DataFrame(np.random.randn(4,3), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])
print(frame)
f=lambda x:x.max()-x.min()
frame.apply(f,axis='index')
frame.apply(f,axis='columns')

               b         d         e
Utah   -0.091771 -0.494246 -1.424989
Ohio   -0.211276  0.552959 -0.315622
Texas   1.718107  0.419795  1.415481
Oregon -0.365268 -0.526879 -0.358955

Utah      1.333219
Ohio      0.868581
Texas     1.298312
Oregon    0.167924
dtype: float64

In [216]:
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])
frame.apply(f,axis='index')

            b         d         e
min -0.365268 -0.526879 -1.424989
max  1.718107  0.552959  1.415481

In [217]:
format=lambda x:'%.2f' %x
frame.applymap(format)

            b      d      e
Utah    -0.09  -0.49  -1.42
Ohio    -0.21   0.55  -0.32
Texas    1.72   0.42   1.42
Oregon  -0.37  -0.53  -0.36

In [224]:
frame['b'].map(format)

Utah      -0.09
Ohio      -0.21
Texas      1.72
Oregon    -0.37
Name: b, dtype: object

-----排序和排名-----

In [229]:
# 对于DataFrame，则可以根据任意一个轴上的索引进行排序：
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),index=['three', 'one'],columns=['d', 'a', 'b', 'c'])
frame.sort_index()
frame.sort_index(axis=1)
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [230]:
# 对Series进行排序，可使用其sort_values方法：
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [258]:
frame = pd.DataFrame({'a': [0, 1, 0, 1],'b': [4, 7, -3, 2]})
frame.sort_values(by=['a','b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [319]:
obj=pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()     #默认平均排名
# 排名 1 2 3 4 5 6 7
#     -5,0,2,4,4,7,7
obj.rank(method='first',ascending=False)

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

-----汇总和计算描述统计-----

In [401]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])
print(df)
df.sum(axis=1)
df.mean(axis='columns', skipna=False)     #skipna参数默认忽略NaN
df.cumsum(axis=1)

# 一次性产生多个汇总统计：
df.describe()

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [408]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj.value_counts()
# pd.value_counts(obj.values, sort=False)

c    3
a    3
b    2
d    1
dtype: int64

In [412]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],'Qu2': [2, 3, 1, 2, 3],'Qu3': [1, 5, 2, 4, 4]})
# 结果中的行标签是所有列的唯一值。后面的频率值是每个列中这些值的相应计数：
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0